app/controllers/churches_controller.rb

  def show
    @church = Church.find(params[:id])
---
SELECT * FROM "churches" WHERE ("churches"."id" = 1)

  def edit
    @church = Church.find(params[:id])
---
SELECT * FROM "churches" WHERE ("churches"."id" = 953125641)

  def create
    @church = Church.new(params[:church])

    respond_to do |format|
      if @church.save
---
INSERT INTO "churches" ("name", "city", "zip", "updated_at", "street", "state", "created_at") VALUES('Martin Luther College', 'New Ulm', '56073', '2009-02-26 06:13:11', '1995 Luther Court', 'MN', '2009-02-26 06:13:11')

  def update
    @church = Church.find(params[:id])
---
SELECT * FROM "churches" WHERE ("churches"."id" = 953125641)

  def destroy
    @church = Church.find(params[:id])
    @church.destroy
---
SELECT * FROM "churches" WHERE ("churches"."id" = 1)
DELETE FROM "churches" WHERE "id" = 1