app/controllers/seasons_controller.rb

  def edit
    @season = Season.find(params[:id])
---
SELECT * FROM "seasons" WHERE ("seasons"."id" = 1)

  def create
    @season = Season.new(params[:season])

    respond_to do |format|
      if @season.save
---
INSERT INTO "seasons" ("name", "updated_at", "color", "created_at") VALUES('Easter', '2009-05-01 01:58:03', 'gold', '2009-05-01 01:58:03')

  def update
    @season = Season.find(params[:id])
---
SELECT * FROM "seasons" WHERE ("seasons"."id" = 1)