app/controllers/services_controller.rb

  def show
    @service = Service.find(params[:id])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)

  def edit
    @service = Service.find(params[:id])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)

  def create
    @service = Service.new(params[:service])
    @service.user_id = current_user.id

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("name", "church_id", "updated_at", "season_id", "description", "season", "other", "created_at") VALUES('Christmas Day', NULL, '2009-05-01 00:52:28', 1, 'This is a test.', NULL, NULL, '2009-05-01 00:52:28')

  def update
    @service = Service.find(params[:id])
    @service.user_id = current_user.id

    respond_to do |format|
      if @service.update_attributes(params[:service])
---
SELECT * FROM "services" WHERE ("services"."id" = 2)
UPDATE "services" SET "description" = 'Christmas Day celebration service.', "updated_at" = '2009-05-01 01:14:25' WHERE "id" = 2

  def destroy
    @service = Service.find(params[:id])
    @service.destroy
---
SELECT * FROM "services" WHERE ("services"."id" = 1)
DELETE FROM "services" WHERE "id" = 1