app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("name", "updated_at", "crypted_password", "current_login_ip", "password_salt", "failed_login_count", "persistence_token", "login_count", "email", "last_login_ip", "created_at") VALUES(NULL, '2009-04-29 03:26:33', '2b9d5240bd11b5e6a1c97baaf1ba649466437ef9119df4a91d9be72e0cbe8e07241418e83e3d95b55b3ac5800c78a018dffe0ee9ac4b3fdc8461aa9bcb606628', '127.0.0.1', '0KcAR47qvFmk-LvmgEyX', 0, 'ca310deaad19feea561fde842d9eb846c5b045e6e3f44d80ab0ac9a28caa599016ff8dd7adaea4dd1c2887c0e814116795ac1a1317453b073bb1ce952cbdcd83', 1, 'boblmartens@gmail.com', NULL, '2009-04-29 03:26:33')

  def update
    @user = @current_user

    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "email" = 'bob.martens@railsmagazine.com', "updated_at" = '2009-04-29 03:29:08' WHERE "id" = 1